#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.hostname_update: Refreshing state... [id=8160861740648470700]
tls_private_key.cloud_key: Refreshing state... [id=4965ece76e3a2e4344b631481ab5f389561ff605]
aws_key_pair.cloud_key: Refreshing state... [id=cloud_key]
aws_vpc.ollama_vpc: Refreshing state... [id=vpc-040e0838268eb92a6]
aws_internet_gateway.ollama_igw: Refreshing state... [id=igw-08759d566e985feb0]
aws_security_group.ollama_security_group: Refreshing state... [id=sg-0f8adc0579f07da90]
aws_subnet.ollama_subnet: Refreshing state... [id=subnet-0b799ed0ca30a94a8]
aws_route_table.ollama_pub_igw: Refreshing state... [id=rtb-03532e374b2b825a9]
aws_security_group_rule.ollama_ingress_access: Refreshing state... [id=sgrule-3187998183]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-853614326]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-2966670208]
aws_instance.ollama_instance: Refreshing state... [id=i-07fd38f9190a5593a]
aws_route_table_association.ollama_rt_subnet_public: Refreshing state... [id=rtbassoc-070b26bc085dbdbed]
ansible_host.ollama_instance: Refreshing state... [id=ec2-18-224-53-159.us-east-2.compute.amazonaws.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.ollama_instance has been deleted
  - resource "aws_instance" "ollama_instance" {
      - id                                   = "i-07fd38f9190a5593a" -> null
      - public_dns                           = "ec2-18-224-53-159.us-east-2.compute.amazonaws.com" -> null
      - public_ip                            = "18.224.53.159" -> null
        tags                                 = {
            "Name"      = "ollama-controller"
            "Terraform" = "true"
        }
        # (31 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_internet_gateway.ollama_igw has been deleted
  - resource "aws_internet_gateway" "ollama_igw" {
      - id       = "igw-08759d566e985feb0" -> null
        tags     = {
            "Name"      = "ollama_IGW"
            "Terraform" = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_key_pair.cloud_key has been deleted
  - resource "aws_key_pair" "cloud_key" {
        id          = "cloud_key"
      - key_name    = "cloud_key" -> null
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.ollama_pub_igw has been deleted
  - resource "aws_route_table" "ollama_pub_igw" {
      - id               = "rtb-03532e374b2b825a9" -> null
        tags             = {
            "Name"      = "ollama-RouteTable"
            "Terraform" = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.ollama_security_group has been deleted
  - resource "aws_security_group" "ollama_security_group" {
      - id                     = "sg-0f8adc0579f07da90" -> null
        name                   = "ollama-sg"
        tags                   = {
            "Name"      = "ollama-Security-Group"
            "Terraform" = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.ollama_subnet has been deleted
  - resource "aws_subnet" "ollama_subnet" {
      - id                                             = "subnet-0b799ed0ca30a94a8" -> null
        tags                                           = {
            "Name"      = "ollama-Subnet"
            "Terraform" = "true"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_vpc.ollama_vpc has been deleted
  - resource "aws_vpc" "ollama_vpc" {
      - id                                   = "vpc-040e0838268eb92a6" -> null
        tags                                 = {
            "Name"      = "ollama-VPC"
            "Terraform" = "true"
        }
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # ansible_host.ollama_instance will be updated in-place
  ~ resource "ansible_host" "ollama_instance" {
        id        = "ec2-18-224-53-159.us-east-2.compute.amazonaws.com"
      ~ name      = "ec2-18-224-53-159.us-east-2.compute.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_s3_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2_s3_access_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_s3_access will be created
  + resource "aws_iam_role" "ec2_s3_access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_s3_access_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.s3_access_policy will be created
  + resource "aws_iam_role_policy" "s3_access_policy" {
      + id     = (known after apply)
      + name   = "s3_access_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tfstate-bucket-auto-intelligence/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_instance.ollama_instance will be created
  + resource "aws_instance" "ollama_instance" {
      + ami                                  = "ami-0000d18df18b47ae9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2_s3_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "g4dn.2xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "cloud_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"      = "ollama-controller"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "ollama-controller"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b892df60d43ad9d5814c75e2bf18fd4a6c3db67b"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.ollama_igw will be created
  + resource "aws_internet_gateway" "ollama_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "ollama_IGW"
          + "Terraform" = "true"
        }
      + tags_all = {
          + "Name"      = "ollama_IGW"
          + "Terraform" = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.cloud_key will be created
  + resource "aws_key_pair" "cloud_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "cloud_key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDBXy99vpEdsPA1X4qA1btWId83GYgG54baQRVQ5Pedhlu6UTH98REbrLN7i1QF602pQnw/lWNk3JS4eV0V3AwDxEofE7QTBjov8h5FSJBxGibX8bz1+rckbPL6jMblGwzmcGKmTRf139o9T54hnCKr0dnz2xyzdZBgE6TJuuisjri4g3l0/7RpsqZYGZ7WmP4oWJiyJbqlKEzqAmUWtUjFd4nsXy7kD99dJNu3R1EVRHsixsfOHDUxSPb6kTqpxZ72P946AUGFufdWXyRY9Xc4h/2DRYpn/WJIcBvQDilaaJLaGuYB+/1N+oF31T59lekfumFNNxFQEBGBiYlLay8R"
      + tags_all        = (known after apply)
    }

  # aws_route_table.ollama_pub_igw will be created
  + resource "aws_route_table" "ollama_pub_igw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"      = "ollama-RouteTable"
          + "Terraform" = "true"
        }
      + tags_all         = {
          + "Name"      = "ollama-RouteTable"
          + "Terraform" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.ollama_rt_subnet_public will be created
  + resource "aws_route_table_association" "ollama_rt_subnet_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ollama_security_group will be created
  + resource "aws_security_group" "ollama_security_group" {
      + arn                    = (known after apply)
      + description            = "Security Group for ollama webserver"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ollama-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "ollama-Security-Group"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Name"      = "ollama-Security-Group"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.egress_access will be created
  + resource "aws_security_group_rule" "egress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ollama_ingress_access will be created
  + resource "aws_security_group_rule" "ollama_ingress_access" {
      + cidr_blocks              = [
          + "132.147.159.218/32",
        ]
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # aws_security_group_rule.ssh_ingress_access will be created
  + resource "aws_security_group_rule" "ssh_ingress_access" {
      + cidr_blocks              = [
          + "132.147.159.218/32",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_subnet.ollama_subnet will be created
  + resource "aws_subnet" "ollama_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"      = "ollama-Subnet"
          + "Terraform" = "true"
        }
      + tags_all                                       = {
          + "Name"      = "ollama-Subnet"
          + "Terraform" = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.ollama_vpc will be created
  + resource "aws_vpc" "ollama_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "ollama-VPC"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "ollama-VPC"
          + "Terraform" = "true"
        }
    }

  # null_resource.hostname_update will be destroyed
  # (because null_resource.hostname_update is not in configuration)
  - resource "null_resource" "hostname_update" {
      - id = "8160861740648470700" -> null
    }

Plan: 14 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ instance_id = "i-07fd38f9190a5593a" -> (known after apply)
  ~ public_fqdn = "ec2-18-224-53-159.us-east-2.compute.amazonaws.com" -> (known after apply)
  ~ public_ip   = "18.224.53.159" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*